<?php
/***********************************************************
 * Document Type: Configure
 * Update: 2006/11/10
 * Author: Akon
 * Remark: 网站基本配置, 站点初始化
 ***********************************************************/

    // 定义 root 目录，使用 . 来表示深度
    // 例如:  './'  '../'  '../../'
    define('__SITE_ROOT', '../');

    // -------------------------------------------------------
    // SMARTY 配置
    // -------------------------------------------------------
    $CFG['tpl']['template_dir']      = './templates/';         // 模板所在目录
    $CFG['tpl']['caching']           = false;                  // 是否开户模板缓存
    $CFG['tpl']['cache_lifetime']    = 30;                     // 缓存重建间隔时间

    // -------------------------------------------------------
    // LANGUAGE 配置
    // -------------------------------------------------------
    $CFG['lang']['multi']           = false ;                  // 是否存在多国语言版
    $CFG['lang']['default']         = 'cn';                    // 默认的语言包

    require ( __SITE_ROOT . '/core/core.conf.php');